import React, { Fragment } from 'react'
import Footer from '../../Footer/Footer'
import bgsec1 from './img/bgsec1.jpeg'
import n6 from './img/n6.jpg'

const NewsInfo6 = () => {
    return (
        <Fragment>
            <section id="one" className="d-flex justify-content-center align-items-center">
                <img src={bgsec1} alt="ban" className="img-fluid" />
            </section>
            <section id="two" className="d-flex flex-column justify-content-center align-items-center">
                <img src={n6} alt="n6" className="img-fluid" style={{ position: "relative", marginTop: "-10vw", width: "60vw" }} />
                <br />
                <div className="d-flex justify-content-center align-items-center border border-2" style={{ width: "60vw", height: "7.2vh" }}>
                    <h5 style={{ fontSize: 30, fontWeight: "400" }}>ความคิดเห็นจากทีมพัฒนา: 6 พฤศจิกายน 2564</h5>
                </div><br />
                <div className="d-flex flex-column justify-content-start" style={{ width: "60vw" }}>
                    <p className="text-success" style={{ fontSize: 16, fontWeight: "bold" }}>!! ข้างล่างนี้มีสปอยล์ Worlds !!</p>
                    <p style={{ fontSize: 16 }}>ถึงเวลาแล้ว! ในที่สุด Worlds 2021: MAKE/BREAK ก็มาถึงรอบไฟนอล เปิดฉากศึกในตำนานระหว่าง</p>
                    <p style={{ fontSize: 16 }}>Damwon Kia (LCK) และ Edward Gaming (LPL) ในปีนี้มีเรื่องน่าประหลาดใจหลายอย่าง: เกม tiebreak สุดตึงเครียด ผลการแข่งขันที่ไม่คาดคิด การนองเลือดไม่มีสิ้นสุด และ Pick ในรอบ Wildcard ด้วย Finals ที่อยู่ตรงหน้า (และพรีซีซั่นที่ยังอยู่ใน PBE) บทความนี้จะจริงจังน้อยกว่าปกตินิดหน่อย</p>
                    <p style={{ fontSize: 16 }}>นี่คือข้อมูลบางส่วนที่เราเห็นจากบนเวทีและความคิดเห็นมีเกี่ยวกับเกมที่เรามี</p>
                    <hr />
                    <p className="text-success" style={{ fontSize: 16, fontWeight: "bold" }}>มาดูเมต้ากันสักหน่อย</p>
                    <p style={{ fontSize: 16, fontWeight: "bold" }}>แชมเปี้ยนที่ทรงพลังเกินไป</p>
                    <p style={{ fontSize: 16, marginTop: "-20px" }}>เป้าหมายหนึ่งในการปรับบาลานซ์สำหรับ Worlds ของเราคือต้องไม่มีแชมเปี้ยนตัวไหนที่ถูกเลือก/ถูกแบนในทุกเกม แต่ถึงจะมีเนิร์ฟไปในแพตช์ 11.16 และ 11.18 Lee Sin ก็เกือบจะเป็นแบบนั้นโดยมีการปรากฏตัวถึง 97% แต่โดยภาพรวมแล้ว ปีนี้ก็ไม่แชมเปี้ยนตัวไหนที่ถูกเลือก/ถูกแบนในทุกเกม</p>
                    <p style={{ fontSize: 16, fontWeight: "bold" }}>ความหลากหลายของแชมเปี้ยน</p>
                    <p style={{ fontSize: 16, marginTop: "-20px" }}>อีกหนึ่งเป้าหมายในการปรับสมดุลสำหรับ Worlds คือเพื่อทำให้มั่นใจว่าเราจะได้ชุดแชมเปี้ยนที่มีความหลากหลายสูง ซึ่งเรานับเฉพาะแชมเปี้ยนที่มีการปรากฏตัวใน pick/ban 5% หรือมากกว่าเท่านั้น ตรงข้ามกับแชมเปี้ยนที่โผล่มาเพียงแค่ครั้งสองครั้ง เพื่อรับรองว่าการหยิบแชมเปี้ยนตัวโปรดของโปรเพลย์เยอร์ไม่ถูกตีความว่าจะสามารถใช้ได้กับทุกทีม มาดูสถานการณ์ของเราในตอนนี้ก่อนเข้า Finals กันดีกว่าครับ:</p>
                    <p style={{ fontSize: 16, fontWeight: "bold" }}>แชมเปี้ยนทั้งหมดที่มีการปรากฏตัว 5% หรือมากกว่า: 62 ตัว</p>
                    <p style={{ fontSize: 16, marginTop: "-20px" }}>แชมเปี้ยนเลนบน: 24 ตัว<br/>แชมเปี้ยนป่า: 13 ตัว<br/>แชมเปี้ยนเลนกลาง: 16 ตัว<br/>แชมเปี้ยน ADC: 10 ตัว<br/>แชมเปี้ยนซัพพอร์ต: 13 ตัว<br/>(เพื่อเปรียบเทียบ พวกเราเห็นแชมเปี้ยน 92 ตัวถูกเลือก/ถูกแบนอย่างน้อยหนึ่งครั้ง)</p>
                    <p style={{ fontSize: 16 }}>เราได้เห็นเมต้าเลนบนที่หลากหลายอย่างไม่น่าเชื่อ ส่วนเลนอื่นก็เกือบไปไม่ถึงเป้าหมายขั้นต่ำของพวกเรา ที่ชัดเจนที่สุดคือ ADC ซึ่งมีแชมเปี้ยนที่มีการปรากฏตัวถึง 5% เพียง 10 ตัวเท่านั้น นี่เป็นผลมาจากความทรงพลังของ Lucian และ Miss Fortune ซึ่งมีการปรากฏตัว 84% เราตื่นเต้นที่ได้เห็น Lucian กลับเข้าเลนล่างมากขึ้นหลังแพตช์ 11.17 แต่เราก็ไม่มีข้อมูลในระดับโปรเพลย์มากพอเพื่อจะทำให้ระดับพลังในโปรเพลย์ของเขาอยู่ในสถานะที่สมบูรณ์แบบ ก่อนหน้า Worlds Miss Fortune ไม่ได้โผล่มาในโปรเพลย์เลย แต่เราเสริมพลังให้เธอหนักไปหน่อยเพื่อจะให้เธออยู่รอด กลับกลายเป็นว่าเธอทรงพลังมากกว่าที่เราตั้งใจไว้</p>
                    <p style={{ fontSize: 16 }}>พวกเราสนุกกับสิ่งที่บรรดาโปรเพลย์เยอร์ได้คิดค้นขึ้นมาจนถึงตอนนี้ใน Worlds แล้วคุณล่ะคิดยังไงกับเมต้าของ Worlds ครับ?</p>
                    <hr />
                    <p className="text-success" style={{ fontSize: 16, fontWeight: "bold" }}>ความคิดเห็นจากทีมพัฒนา</p>
                    <p style={{ fontSize: 16, marginTop: "10px" }}>ส่วนสุดท้ายของบทความนี้เป็นคำพูดจากสมาชิกทีม Summoner’s Rift และทีมวิเคราะห์เกม! (ใช่ครับ พวกเราอยู่อเมริกาเหนือกันหมด)</p>
                    <p style={{ fontSize: 16, marginTop: "10px" }}>“ถึงแม้เราจะมีทีมเดียวที่เหลือรอดแล้วพวกเขาก็โดนยำในรอบ Quarterfinals ผมก็ค่อนข้างภูมิใจกับ NA นะ นี่เป็นปีที่ยากลำบากที่สุดเมื่อคิดว่า LCK และ LPL ได้ seed เพิ่ม ถึงอย่างนั้น TL และ 100T ได้ไป 3-3 ในรอบแบ่งกลุ่มและ C9 ได้ไป 3 เกมด้วย tiebreaker ไม่ว่าเมื่อไรที่มีการขับเคี่ยวระหว่างภูมิภาค มันก็เป็นอะไรที่ดูสนุก” —Riot Blizz</p>
                    <p style={{ fontSize: 16, marginTop: "10px" }}>“ผมดีใจที่เราเพิ่มมือสังหารเข้าไปในเมต้าป่าได้สองสามตัวด้วย Talon และ Qiyana แม้แต่ Zed ก็ได้โผล่เฉิดฉายในรอบ play-in แถมมันก็เจ๋งดีที่ได้เห็นตัวละครใหม่ ๆ โผล่ขึ้นมาในการแข่งขันใหญ่สุดของปีโดยไม่โกงจนเกินไปในเกมจับคู่แบบเดี่ยว” —RiotMadnessHeroo</p>
                    <p style={{ fontSize: 16, marginTop: "10px" }}>“ผมล่ะชอบการสลับเลือกตัวซัพพอร์ตที่หาได้ยากไปมาระหว่าง DK v T1 จริง ๆ การได้เห็นทั้ง Maokai และ Zilean เป็นอะไรที่สดใหม่และย้ำเตือนพวกเราว่า Beryl กับ Keria เป็นที่สุดของที่สุดและคิดสร้างสรรค์อยู่เสมอ” —Riot Sotere</p>
                    <p style={{ fontSize: 16, marginTop: "10px" }}>“เป็นอะไรที่เจ๋งสุด ๆ ที่ได้เห็น DFM ทะลุเข้ารอบและน่าตื่นเต้นมากที่ได้เห็นภูมิภาคเล็ก ๆ ผงาดขึ้นมาบ้าง เกม Tiebreak ครั้งใหญ่นั่นก็น่าตื่นเต้นเหมือนกัน” —RiotPhlox </p>
                    <p style={{ fontSize: 16, marginTop: "10px" }}>“นี่เป็นหนึ่งใน Worlds ที่น่าตื่นเต้นที่สุดสำหรับผม เกมที่ตึงมากและการกลับมานำเกมหลาย ๆ ครั้ง ผมว่าความหลากหลายของแชมเปี้ยนเป็นอะไรที่เจ๋งดีที่ได้เห็น โดยเฉพาะในป่าและเลนบน หวังว่าจะมีทีมเลือก Senna เป็นแชมเปี้ยนที่เอาแน่เอานอนได้คู่กับ Yuumi (เธอยืนเลนได้ดีนะครับ สามารถใช้ Executioner ได้ แถมสเกลได้ด้วย!)” —HydroZenith</p>
                    <p style={{ fontSize: 16, marginTop: "10px" }}>“เกมน่าตื่นเต้นมาก แถมเรื่องราวก็น่าติดตามสุด ๆ โดยทั่วไปแล้วก็มีการเล่นหลายสไตล์ที่ดูจะใช้ได้จริง ยกเว้นแต่แทงค์ในเลนบนหรือป่าอย่างเห็นได้ชัด” —Riot PhRoXzOn<br/> (จากบรรณาธิการ: ไอเทมแทงค์ใหม่ ๆ รวมถึงชิ้นที่ได้รับการปรับปรุงจะมาในพรีซีซั่นนี้!)</p>
                    <p style={{ fontSize: 16, marginTop: "10px" }}>“แชมเปี้ยนตัวโปรดของเหล่าโปรเพลย์เป็นอะไรที่น่าตื่นเต้นเสมอ แต่ผู้เล่นเลนกลาง (Cryin) ก็ไม่ได้ใช้ Annie บนเวที Worlds อย่างประสบความสำเร็จและทำให้ศัตรูกลัวจนต้องแบนเธอในเกมต่อ ๆ มาได้เสมอไปนี่ครับ!”  —Riot Petrie</p>
                    <p style={{ fontSize: 16, marginTop: "10px" }}>“มันมีข้อสงสัยเยอะมากว่า Lucian จะเป็นเลนล่างอย่างแท้จริงในการเล่นระดับสูงได้หรือเปล่า ความสงสัยยิ่งเพิ่มเข้าไปอีกเมื่อเขาพกนักเสริมพลังอย่าง Lulu กับ Nami ไปด้วย” <br/> —Riot Truexy นั่นคือทั้งหมดที่เราจะพูดในตอนนี้ครับทุกคน อย่าลืมดูแมตช์ Final ระหว่าง DK vs EDG วันนี้ ตอน 19.00 น. ด้วยล่ะ!</p>
                    <p className="fst-italic" style={{ fontSize: 16, marginTop: "10px" }}>—ทีม Summoner's Rift</p>
                    <br />
                    <br />
                    <br />
                    <br />
                    <br />
                    <br />
                    <br />
                </div>
            </section>
            <Footer />
        </Fragment>
    )
}

export default NewsInfo6
